tutorials/incompressibleDriftFlux/tank3D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 0;

boundaryField
{
    SYMP3
    {
        type            slip;
    }

    INLE1
    {
        type            calculated;
        value           $internalField;
    }

    "OUTL.*"
    {
        type            calculated;
        value           $internalField;
    }

    "WALL.*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
